site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@

** Bit Manipulations
:PROPERTIES:
:EXPORT_FILE_NAME: bit_manipulations
:EXPORT_DATE: 2023-03-20
:ID:       d7d4e811-1f15-42ca-b44c-fd51153aa8e1
:END:

There are a lot of things you can do using bit-level operations that will speed things up for you.
For example you can check quickly if a number is a power of 2, reveal the lest significant bit, or
zero out a high order or low order part of an integer if you know the proper bit patterns to use.

If you like this lecture, then you may want to check out the book [[https://en.wikipedia.org/wiki/Hacker%27s_Delight][Hacker's Delight]]

*** Materials

- [[/slides/bit-manipulations.pdf][Slides]]

