content/lectures/bit_manipulations.md
+++
title = "Bit Manipulations"
date = 2023-03-20
draft = false
weight = 2
+++

There are a lot of things you can do using bit-level operations that will speed things up for you.
For example you can check quickly if a number is a power of 2, reveal the lest significant bit, or
zero out a high order or low order part of an integer if you know the proper bit patterns to use.

If you like this lecture, then you may want to check out the book [Hacker's Delight](https://en.wikipedia.org/wiki/Hacker%27s_Delight)


## Materials {#materials}

-   [Slides](/slides/bit-manipulations.pdf)
